learn_python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-28 Sun 16:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Learn Python</title>
<meta name="author" content="Yubing Wan" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Learn Python</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2e8a6b3">1. Basic Concepts and Terminoloy</a>
<ul>
<li><a href="#orgaa6772a">1.1. Scripts, Modules, Packages, and Libraries</a></li>
<li><a href="#org5c6918e">1.2. Virtual Environments</a></li>
<li><a href="#org01b26ba">1.3. Class</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2e8a6b3" class="outline-2">
<h2 id="org2e8a6b3"><span class="section-number-2">1.</span> Basic Concepts and Terminoloy</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgaa6772a" class="outline-3">
<h3 id="orgaa6772a"><span class="section-number-3">1.1.</span> Scripts, Modules, Packages, and Libraries</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Script: a Python file that is executable direclty. When run it, it should do something. Scripts often contains code written outside the scope of any classes or functions.</li>

<li>Module: a Python file that&rsquo;s to be imported into scripts or other modules. It often defines members like classes, functions, and variables intended to besed in other files that import it.</li>

<li>Package: a collection of related modules that work together to provide certain functionality. These modules are contained within a folder and can be imported just like any other modules. This folder will often contain a special \_<sub>init</sub>\_<sub>.py</sub> file that tells python it&rsquo;s a package, potentially containing more modules nested within subdirectories.</li>

<li>Library: an umbrella term that loosely means &ldquo;a bundle of code&rdquo;. These can have tens or even hundreds of individual modules that can provide a wide range of functionality. Matplotlib is a plotting library. The Python Standard Library contains hundreds of modules for performing common tasks, like sending emails or reading JSON data. What’s special about the Standard Library is that it comes bundled with your installation of Python, so you can use its modules without having to download them from anywhere.</li>
</ul>
</div>
</div>
<div id="outline-container-org5c6918e" class="outline-3">
<h3 id="org5c6918e"><span class="section-number-3">1.2.</span> Virtual Environments</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>A isolated container with a Python interpreter, PIP executable, and site-package directory</li>
<li>Many VE can be activated, which temporarily tricks the shell into thinking that the only Python and PIP executables are the ones that exist in the virtual environment</li>
<li>Common practice is to use a different VE for each Python project
<ul class="org-ul">
<li>This is especially helpful when two different projects require different versions of the same package. Not even python -m pip can get around this.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org01b26ba" class="outline-3">
<h3 id="org01b26ba"><span class="section-number-3">1.3.</span> Class</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>a blueprint for creating objects (a particular data structure), providing initial values for state (member variables or attributes), and implementations of behavior (member functions or methods)</li>

<li>How to use it
<ol class="org-ol">
<li><p>
Define a Class
</p>

<div class="org-src-container">
<pre class="src src-python">     <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">MyClass</span>:
     <span style="color: #51afef;">def</span> <span style="color: #c678dd;">__init__</span>(<span style="color: #51afef;">self</span>, attribute):
         <span style="color: #51afef;">self</span>.<span style="color: #dcaeea;">attribute</span> = attribute

     <span style="color: #51afef;">def</span> <span style="color: #c678dd;">method</span>(<span style="color: #51afef;">self</span>):
         <span style="color: #51afef;">return</span> f<span style="color: #98be65;">"Value: </span>{<span style="color: #51afef;">self</span>.attribute}<span style="color: #98be65;">"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">     print(<span style="color: #98be65;">"Hello, world!"</span>)
</pre>
</div></li>
</ol></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yubing Wan</p>
<p class="date">Created: 2024-01-28 Sun 16:51</p>
</div>
</body>
</html>
